docs: arch diagrams in mermaid
